html/kotlin/oo/class.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>类与继承</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="./oo.html"> HOME </a>
</div><div id="content">
<h1 class="title">类与继承</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org49c6de3">类</a>
<ul>
<li><a href="#orgdb787d3">构造函数</a>
<ul>
<li><a href="#org62dbb4c">次构造函数</a></li>
</ul>
</li>
<li><a href="#orgc6265ac">创建类的实例</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org49c6de3" class="outline-2">
<h2 id="org49c6de3">类</h2>
<div class="outline-text-2" id="text-org49c6de3">
<p>
Kotlin 中使用关键字 class 声明类
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Invoice</span> { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>

<p>
类声明由类名、类头（指定其类型参数、主构造函数等）以及由花括号包围的类体构成。类头与类体都是可选的； 如果一个类没有类体，可以省略花括号。
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Empty</span>
</pre>
</div>
</div>
<div id="outline-container-orgdb787d3" class="outline-3">
<h3 id="orgdb787d3">构造函数</h3>
<div class="outline-text-3" id="text-orgdb787d3">
<p>
在 Kotlin 中的一个类可以有 <span class="underline">一个</span> <b>主构造函数</b> 以及 <span class="underline">一个或多个</span> <b>次构造函数</b> 。主构造函数是 <span class="underline">类头</span> 的一部分：它跟在 <span class="underline">类名</span> （与可选的类型参数）后。
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Person</span> <span style="color: #00bfff; font-weight: bold;">constructor</span>(firstName: <span style="color: #98f5ff;">String</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>

<p>
如果主构造函数没有任何注解或者可见性修饰符，可以省略这个 <span class="underline">constructor</span> 关键字：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Person</span>(firstName: <span style="color: #98f5ff;">String</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>

<p>
主构造函数不能包含任何的代码
</p>

<pre class="example">
     初始化的代码可以放到以 init 关键字作为前缀的初始化块（initializer blocks）中
</pre>

<p>
在 <span class="underline">实例初始化</span> 期间，初始化块按照它们出现在 <span class="underline">类体中的顺序</span> 执行，与 <span class="underline">属性初始化器</span> 交织在一起：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">InitOrderDemo</span>(name: <span style="color: #98f5ff;">String</span>) {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">firstProperty</span> = <span style="color: #deb887;">"First property: </span><span style="color: #4eee94;">$name</span><span style="color: #deb887;">"</span>.also(::println)

    <span style="color: #00bfff; font-weight: bold;">init</span> {
        println(<span style="color: #deb887;">"First initializer block that prints ${</span>name<span style="color: #deb887;">}"</span>)
    }

    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">secondProperty</span> = <span style="color: #deb887;">"Second property: ${</span>name.length<span style="color: #deb887;">}"</span>.also(::println)

    <span style="color: #00bfff; font-weight: bold;">init</span> {
        println(<span style="color: #deb887;">"Second initializer block that prints ${</span>name.length<span style="color: #deb887;">}"</span>)
    }
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #98f5ff;">InitOrderDemo</span>(<span style="color: #deb887;">"hello"</span>)
}
</pre>
</div>

<p>
请注意， <span class="underline">主构造的参数</span> 可以在 <span class="underline">初始化块</span> 中使用。它们也可以在类体内声明的 <span class="underline">属性初始化器</span> 中使用：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Customer</span>(name: <span style="color: #98f5ff;">String</span>) {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">customerKey</span> = name.toUpperCase()
}
</pre>
</div>


<p>
事实上，声明属性以及从主构造函数初始化属性，Kotlin 有简洁的语法：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Person</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">firstName</span>: <span style="color: #98f5ff;">String</span>, <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">lastName</span>: <span style="color: #98f5ff;">String</span>, <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">age</span>: <span style="color: #98f5ff;">Int</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>

<pre class="example">
     与普通属性一样，主构造函数中声明的属性可以是可变的 var 或只读的 val 
</pre>


<p>
如果构造函数有 <span class="underline">注解</span> 或 <span class="underline">可见性</span> 修饰符，这个 <span class="underline">constructor</span> <b>关键字</b> 是必需的，并且这些修饰符在它前面：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Customer</span> <span style="color: #00bfff; font-weight: bold;">public</span> @<span style="color: #98f5ff;">Inject</span> <span style="color: #00bfff; font-weight: bold;">constructor</span>(name: <span style="color: #98f5ff;">String</span>) { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>
</div>
<div id="outline-container-org62dbb4c" class="outline-4">
<h4 id="org62dbb4c">次构造函数</h4>
<div class="outline-text-4" id="text-org62dbb4c">
<p>
类也可以声明前缀有 <span class="underline">constructor</span> 的 <b>次构造函数</b> ： 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Person</span> {
    <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">children</span>: <span style="color: #98f5ff;">MutableList&lt;Person&gt;</span> = mutableListOf&lt;<span style="color: #98f5ff;">Person&gt;</span>();
    <span style="color: #00bfff; font-weight: bold;">constructor</span>(parent: <span style="color: #98f5ff;">Person</span>) {
        parent.children.add(<span style="color: #00bfff; font-weight: bold;">this</span>)
    }
}
</pre>
</div>

<p>
如果类有一个主构造函数，每个次构造函数需要 <b>委托</b> 给主构造函数， 可以直接委托或者通过别的次构造函数间接委托。委托到同一个类的另一个构造函数用 <span class="underline">this</span> 关键字即可：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Person</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">name</span>: <span style="color: #98f5ff;">String</span>) {
    <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">children</span>: <span style="color: #98f5ff;">MutableList&lt;Person&gt;</span> = mutableListOf&lt;<span style="color: #98f5ff;">Person&gt;</span>();
    <span style="color: #00bfff; font-weight: bold;">constructor</span>(name: <span style="color: #98f5ff;">String</span>, parent: <span style="color: #98f5ff;">Person</span>) : <span style="color: #00bfff; font-weight: bold;">this</span>(name) {
        parent.children.add(<span style="color: #00bfff; font-weight: bold;">this</span>)
    }
}
</pre>
</div>
<p>
请注意：
</p>
<ul class="org-ul">
<li><span class="underline">初始化块</span> 中的代码实际上会成为 <span class="underline">主构造函数的一部分</span></li>
<li><b>委托</b> 给 <span class="underline">主构造函数</span> 会作为 <span class="underline">次构造函数</span> 的 <span class="underline">第一条语句</span></li>
</ul>

<pre class="example">
      因此所有初始化块与属性初始化器中的代码都会在次构造函数体之前执行

      即使该类没有主构造函数，这种委托仍会隐式发生，并且仍会执行初始化块
</pre>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Constructors</span> {
    <span style="color: #00bfff; font-weight: bold;">init</span> {
        println(<span style="color: #deb887;">"Init block"</span>)
    }

    <span style="color: #00bfff; font-weight: bold;">constructor</span>(i: <span style="color: #98f5ff;">Int</span>) {
        println(<span style="color: #deb887;">"Constructor"</span>)
    }
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #98f5ff;">Constructors</span>(1)
}
</pre>
</div>

<p>
如果一个非抽象类没有声明任何（主或次）构造函数，它会有一个生成的 <span class="underline">不带参数的</span> 主构造函数。构造函数的 <span class="underline">默认可见性</span> 是 <span class="underline">public</span> 。如果不希望类有一个公有构造函数，需要声明一个带有 <b>非默认可见性</b> 的空的主构造函数：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">DontCreateMe</span> <span style="color: #00bfff; font-weight: bold;">private</span> <span style="color: #00bfff; font-weight: bold;">constructor</span> () { <span style="color: #5f9ea0; font-style: italic;">/*</span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;*/</span> }
</pre>
</div>

<pre class="example">
      注意：在 JVM 上，如果主构造函数的所有的参数都有默认值，编译器会生成 一个额外的无参构造函数，它将使用默认值

      这使得 Kotlin 更易于使用像 Jackson 或者 JPA 这样的通过无参构造函数创建类的实例的库
</pre>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Customer</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">customerName</span>: <span style="color: #98f5ff;">String</span> = <span style="color: #deb887;">""</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc6265ac" class="outline-3">
<h3 id="orgc6265ac">创建类的实例</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
